Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.swift.browser.core.itermbrowsercontextmenuhelper.view_source.73f201c2
source: View Source
zh_hans: 查看源代码

# ui.swift.browser.core.itermbrowsergateway.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.browser.core.itermbrowsergateway.download.d6eafe82
source: Download
zh_hans: 下载

source: iTerm2 can display web pages! But first you must download the Browser Plugin.
zh_hans: iTerm2 可以显示网页！但您必须先下载浏览器插件。

# ui.swift.browser.core.itermbrowsergateway.not_set.1aef9399
source: not set
zh_hans: 未设置

# ui.swift.browser.core.itermbrowsergateway.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.browser.core.itermbrowsergateway.plugin_required.68601576
source: Plugin Required
zh_hans: 需要浏览器插件

source: The code signature of the plugin at %1$@ is invalid. Download it again, and ensure your anti-virus does not quarantine it.
zh_hans: %1$@ 处插件的代码签名无效。请重新下载，并确保防病毒软件未隔离该插件。

# ui.swift.browser.core.itermbrowsergateway.the_file_at_0_is_not_a_valid.b9dc8a97
source: The file at %1$@ is not a valid app bundle.
zh_hans: %1$@ 处的文件不是有效的 App 包。

source: This is not the browser plugin. This file’s bundle ID is “%1$@”. The expected ID is “%2$@”.
zh_hans: 这不是浏览器插件。此文件的 Bundle ID 为“%1$@”。 预期 ID 为“%2$@”。

# ui.swift.browser.core.itermbrowsergateway.use_system_browser.3e75d58a
source: Use System Browser
zh_hans: 使用系统浏览器

source: You must install the Browser Plugin first. Download it now?
zh_hans: 必须先安装浏览器插件。现在下载吗？

# ui.swift.browser.core.itermbrowsermanager.allow_always.7b52fc23
source: Allow _Always
zh_hans: 始终允许(_A)

# ui.swift.browser.core.itermbrowsermanager.allow_once.9013a356
source: Allow _Once
zh_hans: 仅允许一次(_O)

source: Audio was muted. Allow playback by %1$@?
zh_hans: 音频已静音。允许 %1$@ 播放吗？

# ui.swift.browser.core.itermbrowsermanager.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.browser.core.itermbrowsermanager.de_ny_always.6181d799
source: De_ny Always
zh_hans: 始终拒绝(_N)

# ui.swift.browser.core.itermbrowsermanager.deny_once.92e73763
source: _Deny Once
zh_hans: 拒绝一次(_D)

# ui.swift.browser.core.itermbrowsermanager.invalid_url.82e45382
source: Invalid URL
zh_hans: URL 无效

# ui.swift.browser.core.itermbrowsermanager.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.browser.core.itermbrowsermanager.unknown_url_scheme.f542e0b2
source: Unknown URL scheme
zh_hans: 未知 URL 方案

# ui.swift.browser.core.itermbrowsermanager.web_page_alert.809721e0
source: Web Page Alert
zh_hans: 网页提醒

# ui.swift.browser.core.itermbrowsermanager.web_page_confirmation.8039bc7f
source: Web Page Confirmation
zh_hans: 网页确认

# ui.swift.browser.core.itermbrowserviewcontroller.bookmark_removed.0dbfdec6
source: Bookmark Removed
zh_hans: 已移除书签

source: Could not create movie: %1$@
zh_hans: 无法创建影片：%1$@

# ui.swift.browser.core.itermbrowserviewcontroller.ok.565339bc
source: OK
zh_hans: 好

source: Problem saving instant replay movie
zh_hans: 保存即时回放影片时出现问题

# ui.swift.browser.database.browserbookmarks.date_added.55ad74b6
source: Date Added
zh_hans: 添加日期

# ui.swift.browser.database.browserbookmarks.title.7e8cd205
source: Title
zh_hans: 标题

# ui.swift.browser.database.browserpermissions.allowed.1bb201d1
source: Allowed
zh_hans: 允许

# ui.swift.browser.database.browserpermissions.audio_playback.5f52387f
source: Audio Playback
zh_hans: 音频播放

# ui.swift.browser.database.browserpermissions.blocked.18f2a094
source: Blocked
zh_hans: 阻止

# ui.swift.browser.database.browserpermissions.camera.03494b0d
source: Camera
zh_hans: 摄像头

# ui.swift.browser.database.browserpermissions.camera_and_microphone.43f95e4a
source: Camera and Microphone
zh_hans: 摄像头和麦克风

# ui.swift.browser.database.browserpermissions.location.15b61974
source: Location
zh_hans: 位置

# ui.swift.browser.database.browserpermissions.microphone.186352a8
source: Microphone
zh_hans: 麦克风

# ui.swift.browser.database.browserpermissions.notifications.78801183
source: Notifications
zh_hans: 通知

source: Instant Replay
zh_hans: 即时回放

# ui.swift.browser.instantreplay.videoplaybackwindowcontroller.pause.858e4ba7
source: Pause
zh_hans: 暂停

# ui.swift.browser.instantreplay.videoplaybackwindowcontroller.play.436e6101
source: Play
zh_hans: 播放

source: Play Backward
zh_hans: 反向播放

source: An error occurred while loading this page. %1$@
zh_hans: 加载此页面时出错。%1$@

source: Can’t Connect to Server
zh_hans: 无法连接到服务器

# ui.swift.browser.localpages.itermbrowsererrorhandler.certificate_chain.d35d94bd
source: Certificate chain:
zh_hans: 证书链：

# ui.swift.browser.localpages.itermbrowsererrorhandler.file_not_found.bf599881
source: File Not Found
zh_hans: 找不到文件

source: iTerm2 can’t establish a secure connection to the server. The server may be down or unreachable.
zh_hans: iTerm2 无法与服务器建立安全连接。服务器可能已关闭或无法访问。

source: iTerm2 can’t find the server. Check that the web address is correct and try again.
zh_hans: iTerm2 找不到该服务器。请检查网址是否正确后重试。

source: iTerm2 can’t open the page because the server redirected too many times.
zh_hans: iTerm2 无法打开此页面，因为服务器重定向次数过多。

source: iTerm2 can’t verify the identity of the website. The connection may not be secure.
zh_hans: iTerm2 无法验证网站身份。连接可能不安全。

source: Network Connection Lost
zh_hans: 网络连接已中断

source: No Internet Connection
zh_hans: 无互联网连接

source: No root certificate found to anchor the chain.
zh_hans: 找不到用于锚定证书链的根证书。

source: Page Can’t Be Loaded
zh_hans: 无法加载页面

# ui.swift.browser.localpages.itermbrowsererrorhandler.page_not_available.7bc21700
source: Page Not Available
zh_hans: 页面不可用

# ui.swift.browser.localpages.itermbrowsererrorhandler.page_unavailable.fcc759f1
source: Page Unavailable
zh_hans: 页面不可用

source: Secure Connection Failed
zh_hans: 安全连接失败

# ui.swift.browser.localpages.itermbrowsererrorhandler.server_not_found.5320e6c0
source: Server Not Found
zh_hans: 找不到服务器

source: The certificate is expired.
zh_hans: 证书已过期。

source: The certificate is malformed or otherwise bad.
zh_hans: 证书格式错误或无效。

source: The certificate is not yet valid.
zh_hans: 证书尚未生效。

source: The Connection Timed Out
zh_hans: 连接超时

source: The hostname does not match the certificate.
zh_hans: 主机名与证书不匹配。

source: The network connection was lost. Check your internet connection and try again.
zh_hans: 网络连接已中断。请检查互联网连接后重试。

source: The presented chain is not valid (e.g., self-signed without trust).
zh_hans: 提供的证书链无效（例如，未受信任的自签名证书）。

source: The requested file does not exist.
zh_hans: 请求的文件不存在。

source: The requested page is currently unavailable. Try again later.
zh_hans: 请求的页面当前不可用。请稍后重试。

source: The root CA is unknown (not in trust store).
zh_hans: 根证书颁发机构未知（不在信任存储中）。

source: The server didn’t respond in time. The site may be temporarily unavailable or overloaded.
zh_hans: 服务器未及时响应。该网站可能暂时不可用或负载过高。

source: The server’s DNS address could not be found. Check that the web address is correct.
zh_hans: 找不到服务器的 DNS 地址。请检查网址是否正确。

# ui.swift.browser.localpages.itermbrowsererrorhandler.too_many_redirects.531d3bd3
source: Too Many Redirects
zh_hans: 重定向次数过多

source: Your computer appears to be offline. Check your internet connection and try again.
zh_hans: 您的电脑似乎已离线。请检查互联网连接后重试。

source: Your computer is not connected to the internet. Check your connection and try again.
zh_hans: 您的电脑未连接到互联网。请检查连接后重试。

# ui.swift.browser.localpages.itermbrowserfilehandler.file_not_found_0.255ad07b
source: File not found: %1$@
zh_hans: 找不到文件：%1$@

# ui.swift.browser.localpages.itermbrowserfilehandler.no_path_specified.17a4e672
source: No path specified
zh_hans: 未指定路径

source: Invalid file path: %1$@
zh_hans: 文件路径无效：%1$@

# ui.swift.browser.localpages.itermbrowserlocalpagemanager.unknown_0_url.fcaa1a81
source: Unknown %1$@ URL
zh_hans: 未知的 %1$@ URL

source: Failed to encode redirect HTML
zh_hans: 无法编码重定向 HTML

source: Could not save the page: %1$@
zh_hans: 无法保存网页：%1$@

source: Failed to create save directory
zh_hans: 无法创建保存目录

source: Failed to get page HTML content
zh_hans: 无法获取网页 HTML 内容

# ui.swift.browser.pagesaver.itermbrowserpagesaver.failed_to_save_file.a11e2c2c
source: Failed to save file
zh_hans: 无法保存文件

# ui.swift.browser.pagesaver.itermbrowserpagesaver.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.browser.pagesaver.itermbrowserpagesaver.save_failed.9bcdbf65
source: Save Failed
zh_hans: 保存失败

# ui.swift.browser.passwordmanager.itermbrowserpasswordwriter.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.browser.passwordmanager.itermbrowserpasswordwriter.ok.565339bc
source: OK
zh_hans: 好

source: The focused field is not a password field. Fill it anyway?
zh_hans: 当前聚焦的输入框不是密码框。仍要填入吗？

# ui.swift.browser.permissions.itermbrowserpermissionmanager.allow.e213c161
source: Allow
zh_hans: 允许

# ui.swift.browser.permissions.itermbrowserpermissionmanager.allow_0.2b456e85
source: Allow %1$@
zh_hans: 允许%1$@

# ui.swift.browser.permissions.itermbrowserpermissionmanager.block.211d0bb8
source: Block
zh_hans: 阻止

source: The website %1$@ wants to access %2$@.
zh_hans: 网站 %1$@ 想要访问%2$@。

source: Ad block rules updated successfully
zh_hans: 广告拦截规则已成功更新

source: Ad blocking disabled
zh_hans: 已停用广告拦截

source: Ad blocking enabled
zh_hans: 已启用广告拦截

source: All website data has been cleared successfully!
zh_hans: 已成功清除所有网站数据！

source: Extension disabled
zh_hans: 已停用扩展

# ui.swift.browser.settings.itermbrowsersettingshandler.extension_enabled.866b8d57
source: Extension enabled
zh_hans: 已启用扩展

source: Extension management not available
zh_hans: 扩展管理不可用

source: Extensions directory not configured in profile preferences
zh_hans: 配置文件设置中未配置扩展目录

source: Extensions directory revealed in Finder
zh_hans: 已在访达中显示扩展目录

source: Extensions not supported on this macOS version
zh_hans: 此 macOS 版本不支持扩展

source: Failed to create extensions directory: %1$@
zh_hans: 无法创建扩展目录：%1$@

source: Failed to update ad block rules: %1$@
zh_hans: 无法更新广告拦截规则：%1$@

source: Filter list URL updated
zh_hans: 过滤列表 URL 已更新

source: Invalid link opening preference
zh_hans: 链接打开偏好无效

source: Invalid port number
zh_hans: 端口号无效

source: Invalid search URL: must contain %@ placeholder
zh_hans: 搜索 URL 无效：必须包含 %@ 占位符

source: Invalid suggestion URL: must contain %@ placeholder
zh_hans: 搜索建议 URL 无效：必须包含 %@ 占位符

source: Link opening preference set to always ask
zh_hans: 链接打开方式已设为始终询问

source: Links will always open in built-in browser
zh_hans: 链接将始终在内置浏览器中打开

source: Links will always open in default browser
zh_hans: 链接将始终在默认浏览器中打开

source: No description available
zh_hans: 无可用描述

# ui.swift.browser.settings.itermbrowsersettingshandler.proxy_disabled.b73022a5
source: Proxy disabled
zh_hans: 已停用代理

# ui.swift.browser.settings.itermbrowsersettingshandler.proxy_enabled.474f3f1d
source: Proxy enabled
zh_hans: 已启用代理

source: Proxy host updated
zh_hans: 代理主机已更新

source: Proxy port updated
zh_hans: 代理端口已更新

source: Search engine updated
zh_hans: 搜索引擎已更新

source: Search suggestions disabled
zh_hans: 已停用搜索建议

source: Search suggestions updated
zh_hans: 搜索建议已更新

source: The browser database could not be deleted. It is in %1$@
zh_hans: 无法删除浏览器数据库。数据库位于 %1$@

source: The browser database could not be deleted. Your application support folder could not be found.
zh_hans: 无法删除浏览器数据库，因为找不到应用支持文件夹。

source: Search Suggestion
zh_hans: 搜索建议

# ui.swift.browser.suggestions.itermbrowsersuggestionscontroller.bookmark.1bac4007
source: Bookmark
zh_hans: 书签

source: Navigate to "%1$@"
zh_hans: 前往“%1$@”

source: Search for "%1$@"
zh_hans: 搜索“%1$@”

source: Web Search
zh_hans: 网页搜索

# ui.swift.browser.ui.itermbrowsertoolbar.add_bookmark.7d02d990
source: Add Bookmark
zh_hans: 添加书签

# ui.swift.browser.ui.itermbrowsertoolbar.ask_ai.744b8589
source: Ask AI…
zh_hans: 询问 AI…

# ui.swift.browser.ui.itermbrowsertoolbar.back.76900f1b
source: Back
zh_hans: 后退

# ui.swift.browser.ui.itermbrowsertoolbar.debug_autofill_fields.b3d15532
source: Debug Autofill Fields
zh_hans: 调试自动填充字段

# ui.swift.browser.ui.itermbrowsertoolbar.dev_null_mode.8893fbdb
source: Dev Null Mode
zh_hans: /dev/null 模式

# ui.swift.browser.ui.itermbrowsertoolbar.exit_distraction_removal.4182ffd5
source: Exit Distraction Removal
zh_hans: 退出干扰项移除模式

# ui.swift.browser.ui.itermbrowsertoolbar.exit_reader_mode.4f8520e6
source: Exit Reader Mode
zh_hans: 退出阅读模式

# ui.swift.browser.ui.itermbrowsertoolbar.forward.f1c65e14
source: Forward
zh_hans: 前进

# ui.swift.browser.ui.itermbrowsertoolbar.history.0e769600
source: History
zh_hans: 历史记录

# ui.swift.browser.ui.itermbrowsertoolbar.manage_bookmarks.a23abeb8
source: Manage Bookmarks
zh_hans: 管理书签

# ui.swift.browser.ui.itermbrowsertoolbar.menu.99af6606
source: Menu
zh_hans: 菜单

# ui.swift.browser.ui.itermbrowsertoolbar.reader_mode.0622264d
source: Reader Mode
zh_hans: 阅读模式

# ui.swift.browser.ui.itermbrowsertoolbar.reload.bdc090ec
source: Reload
zh_hans: 重新加载

# ui.swift.browser.ui.itermbrowsertoolbar.remove_bookmark.8894fce4
source: Remove Bookmark
zh_hans: 移除书签

# ui.swift.browser.ui.itermbrowsertoolbar.remove_distractions.6b70a47d
source: Remove Distractions
zh_hans: 移除干扰项

# ui.swift.browser.ui.itermbrowsertoolbar.reset_0_permission_1.b8a84217
source: Reset %1$@ Permission (%2$@)
zh_hans: 重置%1$@权限（%2$@）

# ui.swift.browser.ui.itermbrowsertoolbar.settings.74a883a0
source: Settings
zh_hans: 设置

# ui.swift.browser.ui.itermbrowsertoolbar.stop.cae7d57b
source: Stop
zh_hans: 停止

# ui.swift.browser.ui.itermbrowsertoolbar.unmute_current_page.d268b383
source: Unmute Current Page
zh_hans: 取消当前网页静音

# ui.swift.browser.ui.itermurlbar.loading_suggestions.462d64c2
source: Loading suggestions…
zh_hans: 正在加载建议…

# ui.swift.browser.ui.itermurlbar.search_or_enter_website_name.e68b3bd5
source: Search or enter website name
zh_hans: 搜索或输入网站名称

# ui.swift.browser.ui.itermurlbar.site_icon_drag_to_copy_url.55bd0c9c
source: Site icon - drag to copy URL
zh_hans: 网站图标—拖动可拷贝 URL

source: Invalid source URL
zh_hans: 源代码 URL 无效

source: No source available
zh_hans: 无可用源代码

# ui.swift.browser.webviewadditions.itermbrowserwebview_actions.copied.8d525e5f
source: Copied
zh_hans: 已拷贝

# ui.swift.categories.nsfilemanager_iterm.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.categories.nsfilemanager_iterm.failed_to_create_0_1.138c7e09
source: Failed to create %1$@: %2$@
zh_hans: 无法创建 %1$@： %2$@

# ui.swift.categories.nsfilemanager_iterm.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.categories.nsfilemanager_iterm.try_again.df0fe9e0
source: Try Again
zh_hans: 重试

source: Would you like to create the directory at %1$@?
zh_hans: 要在 %1$@ 创建目录吗？

source: %1$@ Continue removing the workgroup and triggers anyway? cc-status will keep running until you fix the underlying issue and try again.
zh_hans: %1$@ 仍要继续移除工作组和触发器吗？在您修复根本问题并重试之前，cc-status 将继续运行。

# ui.swift.claudecode.claudecodeintegrationmenucontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

source: ~/.claude/settings.json couldn’t be parsed as JSON. Open it in a text editor and check it for syntax errors.
zh_hans: 无法将 ~/.claude/settings.json 解析为 JSON。请在文本编辑器中打开该文件并检查语法错误。

# ui.swift.claudecode.claudecodeintegrationmenucontroller.continue.31fbef16
source: Continue
zh_hans: 继续

source: Could not read ~/.claude/settings.json — check the file’s permissions.
zh_hans: 无法读取 ~/.claude/settings.json——请检查文件权限。

source: Could not write to ~/.claude/settings.json — check the file’s permissions.
zh_hans: 无法写入 ~/.claude/settings.json——请检查文件权限。

source: Couldn’t Remove Hooks
zh_hans: 无法移除钩子

# ui.swift.claudecode.claudecodeintegrationmenucontroller.disable.b7e3e4aa
source: Disable
zh_hans: 禁用

source: Disable the Python API?
zh_hans: 禁用 Python API？

# ui.swift.claudecode.claudecodeintegrationmenucontroller.leave_enabled.2350465f
source: Leave Enabled
zh_hans: 保持启用

source: The installer enabled iTerm2’s Python API. Other scripts or integrations may be using it now. Leave it enabled, or turn it off?
zh_hans: 安装程序已启用 iTerm2 的 Python API。其他脚本或集成现在可能正在使用它。要保持启用，还是将其关闭？

source: This removes the cc-status hook from ~/.claude/settings.json, the Claude Code workgroup from your settings, and the Enter/Exit Workgroup triggers from every profile. You can reinstall any time using iTerm2 > Install Claude Code Integration.
zh_hans: 这会从 ~/.claude/settings.json 中移除 cc-status 钩子，从设置中移除 Claude Code 工作组，并从所有配置文件中移除“进入/退出工作组”触发器。您可以随时通过 iTerm2 > 安装 Claude Code 集成重新安装。

# ui.swift.claudecode.claudecodeintegrationmenucontroller.uninstall.fe199528
source: Uninstall
zh_hans: 卸载

source: Uninstall Claude Code Integration?
zh_hans: 卸载 Claude Code 集成？

source: Also update %1$lld sessions whose profiles are missing
zh_hans: 同时更新 %1$lld 个源配置文件已丢失的会话

source: Also update 1 session whose profile is missing
zh_hans: 同时更新 1 个源配置文件已丢失的会话

# ui.swift.claudecode.claudecodeonboarding.auto_enter_workgroup.e3c02e2c
source: Auto-Enter Workgroup
zh_hans: 自动进入工作组

# ui.swift.claudecode.claudecodeonboarding.back.76900f1b
source: Back
zh_hans: 后退

# ui.swift.claudecode.claudecodeonboarding.before_you_start.467eac1e
source: Before You Start
zh_hans: 开始之前

# ui.swift.claudecode.claudecodeonboarding.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.claudecode.claudecodeonboarding.claude_code_integration_setup.216c517c
source: Claude Code Integration Setup
zh_hans: Claude Code 集成设置

# ui.swift.claudecode.claudecodeonboarding.close.7d9eb7ac
source: Close
zh_hans: 关闭

# ui.swift.claudecode.claudecodeonboarding.continue.31fbef16
source: Continue
zh_hans: 继续

# ui.swift.claudecode.claudecodeonboarding.could_not_write_to_0_1.cbd7bf52
source: Could not write to %1$@: %2$@
zh_hans: 无法写入 %1$@：%2$@

# ui.swift.claudecode.claudecodeonboarding.do_it.0c4c78a3
source: Do It
zh_hans: 执行

# ui.swift.claudecode.claudecodeonboarding.don_t_panic_all_of_this_can_be.5937a270
source: Don’t panic! All of this can be undone later via iTerm2 > Uninstall Claude Code Integration.
zh_hans: 所有这些更改以后都可以通过“iTerm2”>“卸载 Claude Code 集成”撤销。

# ui.swift.claudecode.claudecodeonboarding.dynamic_profiles_selected.b365e9c7
source: Dynamic Profiles Selected
zh_hans: 已选择动态配置文件

# ui.swift.claudecode.claudecodeonboarding.enable.5342e09f
source: Enable
zh_hans: 启用

# ui.swift.claudecode.claudecodeonboarding.enable_python_api.3013992d
source: Enable Python API
zh_hans: 启用 Python API

# ui.swift.claudecode.claudecodeonboarding.failed_to_install_hook.879041a6
source: Failed to install hook
zh_hans: 安装钩子失败

source: Includes running sessions that were created from a profile that has since been deleted.
zh_hans: 包括通过现已删除的配置文件创建、但仍在运行的会话。

# ui.swift.claudecode.claudecodeonboarding.install.569ca49f
source: Install
zh_hans: 安装

source: Install a Claude Code hook that lets iTerm2 detect Claude’s state (working, waiting, idle) and display it in the Session Status tool. This adds a hook to your Claude Code settings that runs automatically as Claude works.
zh_hans: 安装 Claude Code 钩子，使 iTerm2 能检测 Claude 的状态（正在工作、正在等待、空闲），并在“会话状态”工具中显示。 这会在 Claude Code 设置中添加一个钩子，并在 Claude 工作时自动运行。

# ui.swift.claudecode.claudecodeonboarding.install_auto_enter_triggers.f1a13418
source: Install Auto-Enter Triggers
zh_hans: 安装自动进入触发器

# ui.swift.claudecode.claudecodeonboarding.install_hook.58663632
source: Install Hook
zh_hans: 安装钩子

source: Install the Claude Code workgroup, which groups your main Claude session with two peer sessions: a diff viewer and a code-review session. You can switch between them with one click. You can customize this layout later in Settings > Shortcuts > Workgroups.
zh_hans: 安装 Claude Code 工作组，将主 Claude 会话与两个对等会话（差异查看器和代码审查会话）编为一组。您可以点按一次在它们之间切换。 之后可在“设置”>“快捷键”>“工作组”中自定义此布局。

# ui.swift.claudecode.claudecodeonboarding.install_workgroup.070ece19
source: Install Workgroup
zh_hans: 安装工作组

source: • iTerm2’s Python API is enabled • A cc-status hook is added to ~/.claude/settings.json • The toolbelt is shown • A Claude Code workgroup is added to iTerm2’s settings • Enter/Exit Workgroup triggers are added to the profiles you pick
zh_hans: • 启用 iTerm2 的 Python API • 将 cc-status 钩子添加到 ~/.claude/settings.json • 显示工具侧栏 • 将 Claude Code 工作组添加到 iTerm2 设置 • 将“进入/退出工作组”触发器添加到您选择的配置文件

source: Learn more about the Claude Code integration
zh_hans: 进一步了解 Claude Code 集成

# ui.swift.claudecode.claudecodeonboarding.mark_rewritable_install.caec173a
source: Mark Rewritable & Install
zh_hans: 标记为可重写并安装

# ui.swift.claudecode.claudecodeonboarding.next.1ff57a29
source: Next
zh_hans: 下一步

source: Pick the profiles you’ll run claude in. We’ll add Enter/Exit Workgroup triggers to each one so the Claude Code workgroup is entered automatically.
zh_hans: 选择要在其中运行 claude 的配置文件。我们会为每个配置文件添加“进入/退出工作组”触发器，以自动进入 Claude Code 工作组。

source: Pick the terminal profiles where you run claude. iTerm2 will add triggers so the Claude Code workgroup is entered automatically when claude starts and exited when it stops. Without this, you can still enter the workgroup manually via Shell > Workgroups > Claude Code.
zh_hans: 选择用于运行 claude 的终端配置文件。iTerm2 将添加触发器，以便在 claude 启动时自动进入 Claude Code 工作组，并在其停止时退出。 即使不这样设置，您仍可通过“Shell”>“工作组”>“Claude Code”手动进入工作组。

# ui.swift.claudecode.claudecodeonboarding.show.0df6f1ca
source: Show
zh_hans: 显示

source: Show the toolbelt and enable the Session Status tool. The toolbelt appears on the right side of your terminal window. You can toggle the toolbelt from View > Toolbelt > Show Toolbelt, or with the shortcut ⌘⇧B.
zh_hans: 显示工具侧栏并启用“会话状态”工具。工具侧栏显示在终端窗口右侧。 您可以通过“显示”>“工具侧栏”>“显示工具侧栏”或快捷键 ⌘⇧B 切换工具侧栏。

# ui.swift.claudecode.claudecodeonboarding.show_toolbelt.fab4c242
source: Show Toolbelt
zh_hans: 显示工具侧栏

# ui.swift.claudecode.claudecodeonboarding.skip_dynamic_profiles.1de66c6d
source: Skip Dynamic Profiles
zh_hans: 跳过动态配置文件

source: The Claude Code integration relies on iTerm2’s Python API to find sessions running Claude and track their status. The Python API is currently disabled. Setup can’t continue until it is enabled. Click Enable to turn it on.
zh_hans: Claude Code 集成依赖 iTerm2 的 Python API 来查找正在运行 Claude 的会话并跟踪其状态。 Python API 当前已禁用。启用前无法继续设置。点按“启用”将其开启。

source: These profiles are dynamic and not marked “rewritable,” so iTerm2 normally regenerates them from disk and any change here would be lost: %1$@ iTerm2 can write the triggers back to dynamic profiles when they’re marked rewritable. Rewriting can change the order of values in the underlying file.
zh_hans: 这些配置文件是动态的，且未标记为“可重写”，因此 iTerm2 通常会从磁盘重新生成它们；此处所做的任何更改都将丢失： %1$@ 当动态配置文件标记为可重写时，iTerm2 可以将触发器写回。重写可能会改变底层文件中各值的顺序。

# ui.swift.claudecode.claudecodeonboarding.unknown.8fe7794d
source: (unknown)
zh_hans: （未知）

# ui.swift.claudecode.claudecodeonboarding.what_gets_changed.797f4e6b
source: What gets changed
zh_hans: 会进行哪些更改

source: Claude Code Integration Looks Broken
zh_hans: Claude Code 集成似乎已损坏

source: iTerm2’s cc-status hook is no longer in ~/.claude/settings.json. This usually means Claude Code rewrote that file. Reinstall the hook so per-tab status indicators (“Working…,” “Waiting…”) work again?
zh_hans: iTerm2 的 cc-status 钩子已不在 ~/.claude/settings.json 中。这通常表示 Claude Code 重写了该文件。要重新安装钩子，使每个标签页的状态指示器（“正在工作…”、“正在等待…”）恢复正常吗？

# ui.swift.claudecode.claudeintegrationhealthmonitor.not_now.ccb4c324
source: Not Now
zh_hans: 暂不

# ui.swift.claudecode.claudeintegrationhealthmonitor.reinstall.c630a782
source: Reinstall
zh_hans: 重新安装

source: Add a command after the @mention
zh_hans: 请在 @ 提及后添加命令

# ui.swift.claudecode.cockpitwindowcontroller.all_0.37d129e3
source: All (%1$lld)
zh_hans: 全部（%1$lld）

# ui.swift.claudecode.cockpitwindowcontroller.buried_sessions.3bc1ad71
source: Buried Sessions
zh_hans: 已隐藏的会话

source: Group sessions by status (Waiting / Working / Idle), within each window.
zh_hans: 按状态（等待/工作中/空闲）对每个窗口内的会话分组。

source: Group sessions by window, then by tab and split pane.
zh_hans: 先按窗口，再按标签页和分割窗格对会话分组。

# ui.swift.claudecode.cockpitwindowcontroller.no_matching_sessions.2732406e
source: No matching sessions
zh_hans: 没有匹配的会话

source: No running sessions to send to
zh_hans: 没有可接收命令的运行中会话

# ui.swift.claudecode.cockpitwindowcontroller.no_status.eace244c
source: No status
zh_hans: 无状态

# ui.swift.claudecode.cockpitwindowcontroller.notify_on_status_change.526146c2
source: Notify on status change
zh_hans: 状态更改时通知

source: Notify on status change armed
zh_hans: 已启用状态更改通知
